       01 DFHCOMMAREA.
          05 LS-REQUEST.
             10 LS-REQUEST-TYPE                  PIC 9(4) COMP.
                   88 FILES-REQUESTED        VALUE 0.
                   88 PROGRAMS-REQUESTED     VALUE 1.
                   88 TRANSACTIONS-REQUESTED VALUE 2 THROUGH 9999.
             10 LS-ALL-ITEMS                     PIC X(4).
             10 LS-MAX-ITEMS REDEFINES LS-ALL-ITEMS
                                                 PIC 9(4).
             10 LS-SEARCH-CRITERIA.
                15 LS-STARTWITH                  PIC X(8).
                15 LS-STARTWITH-LEN              PIC 9(9) COMP-3.
    
          05 LS-REPLY.
             10 LS-REPLY-TYPE                    PIC 9(4) COMP.
                   88 ITEMS-FOUND        VALUE 0.
                   88 NO-ITEMS-FOUND     VALUE 1.
                   88 ERROR-FOUND        VALUE 2.
             10 LS-REPLY-DATA.
                15 LS-ITEMS-COUNT                PIC 9(9) COMP-5.
                15 LS-ITEMS-ARRAY OCCURS 1 TO 500
                               DEPENDING ON LS-ITEMS-COUNT.
                   20 LS-FILES-DATA. 
                      25 LS-FILE-NAME            PIC X(8).
                      25 LS-FILE-DSNAME          PIC X(44).
                      25 LS-FILE-ENABLESTATUS    PIC X(12).
                
                   20 LS-PROGRAMS-DATA REDEFINES LS-FILES-DATA.
                      25 LS-PROGRAM-NAME         PIC X(8).
                      25 LS-PROGRAM-TYPE         PIC X(12).
                      25 LS-PROGRAM-LANGUAGE     PIC X(12).
                      25 LS-PROGRAM-LENGTH       PIC S9(9) COMP.
                      25 LS-PROGRAM-USECOUNT     PIC S9(9) COMP.
                      25                         PIC X(24).
                
                   20 LS-TRANSACTIONS-DATA REDEFINES LS-FILES-DATA.
                      25 LS-TRANSACTION-NAME     PIC X(8).
                      25 LS-TRANSACTION-PROGRAM  PIC X(8).
                      25 LS-TRANSACTION-STATUS   PIC X(12).
                      25                         PIC X(36).

