       IDENTIFICATION DIVISION.
       PROGRAM-ID. LISTSSDO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 DFHCOMMAREA.
          05 LIST-ODO-SIZE PIC 9(4) COMP.
          05 LIST-ODO OCCURS 1 TO 100 DEPENDING LIST-ODO-SIZE PIC X(5).
       PROCEDURE DIVISION.
           GOBACK.
